Repository: me-vlad/xyzcmd
Catalog: po/*.utf8.po
Languages: ru_ru

source: Unable to register action: invalid rule: %s
ru_ru: Невозможно зарегестрировать действие: неверное правило: %s

source: Class must be instantiated first!
ru_ru: Класс должен быть сначала проинициализирован!

source: DSL Error: %s
ru_ru: Ошибка DSL: %s

source: Unable to load plugin %s: %s
ru_ru: Невозможно загрузить плагин %s: %s

source: Unable to bind shortcut %s: %s
ru_ru: Невозможно связать клавиатурную комбинацию %s: %s

source: Unable to register action: %s
ru_ru: Невозможно зарегестрировать действие: %s

source: Unable to expand macro %s: %s
ru_ru: Невозможно развернуть макрос %s: %s

source: Error in DSL shell execution: %s
ru_ru: Ошибка при выполнении DSL оболочки: %s

source: Invalid object type: %s. Function expected
ru_ru: Неверный тип объекта: %s. Ожидается функция

source: Invalid opts type: %s. Dict instance expected
ru_ru: Неверный тип аргумента: %s. Ожидается словарь (dict)

source: Invalid function %s
ru_ru: Неверная функция

source: Error setting VFS prefix: %s
ru_ru: Ошибка установки VFS префикса: %s

source: Error registering new hook: %s
ru_ru: Ошибка регистрации нового обработчика: %s

source: Error parsing FSRule: %s
ru_ru: Ошибка разбора правила FSRule: %s

source: Error creating Palette instance: %s
ru_ru: Ошибка создания экземпляра Palette: %s

source: Error creating Skin instance: %s
ru_ru: Ошибка создания экземпляра Skin: %s

source: Error in DSL execution: %s
ru_ru: Ошибка выполнения DSL: %s

source: Error extending FSRule: token %s already registered
ru_ru: Ошибка раширения FSRule: токен %s уже зарегестрирован

source: Error extending FSRule: trans_func and match_func arguments must be functions.
ru_ru: Ошибка раширения FSRule: аргументы trans_func и match_func должны быть функциями.

source: Invalid argument type: %s, VFSObject expected
ru_ru: Неверный тип аргумента: %s, ожидается VFSObject

source: Error in calling extended transformation function: %s
ru_ru: Ошибка вызова преобразующей функции: %s

source: Invalid size{} argument: %s
ru_ru: Неверный аргумент выражения size{}: %s

source: Error in calling extended match function: %s
ru_ru: Ошибка вызова расширенной сопоставляющей функции: %s

source: Unable to find match function for token: %s
ru_ru: Невозможно найти сопоставляющую функцию для токена: %s

source: HookManager: Callable argument expected
ru_ru: HookManager: ожидается вызываемый аргумент

source: Error running callback procedure for event %s
ru_ru: Ошибка вызова обратной функции для события %s

source: Invalid shortcut type: %s.
ru_ru: Неверный тип клавиши быстрого доступа: %s.

source: <Internal function object>
ru_ru: <Внутренняя функция>

source: Invalid method type: %s. Must be string or function
ru_ru: Неверный тип метода: %s. Должна быть строка либо функция

source: Logger console
ru_ru: Журнал

source: Max-size must be a positive integer number
ru_ru: Max-size должен быть положительным целым числом

source: Skin %s is not usable with requested color settings. Using default.
ru_ru: Тему %s невозможно использовать с запрошенной цветомой схемой. Используется значения по-умолчанию.

source: Error parsing system config %s: %s
ru_ru: Ошибка разбора системного конфигурационного файла %s: %s

source: Error parsing user config %s: %s
ru_ru: Ошибка разбора пользовательского конфигурационного файла %s: %s

source: Error parsing config %s: %s
ru_ru: Ошибка разбора конфигурационного файла %s: %s

source: Must be implemented in child class
ru_ru: Должно быть реализовано в дочернем классе

source: Parse error
ru_ru: Ошибка разбора

source: Syntax error
ru_ru: Синтаксическая ошибка

source: Unknown variable %s
ru_ru: Неизвестная переменная %s

source: Invalid variable name: %s
ru_ru: Неверное имя переменной: %s

source: Variable transformation error: %s
ru_ru: Ошибка преобразования переменной: %s

source: Unterminated quote
ru_ru: Незакрытая кавычка

source: Unclosed block
ru_ru: Незакрытый блок

source: Unterminated expression
ru_ru: Незавершенное выражение

source: Source string
ru_ru: Исходная строка

source: Error
ru_ru: Ошибка

source: Press ENTER to submit value. ESCAPE to quit
ru_ru: Нажмите ENTER чтобы ввести значение. ESCAPE - чтобы выйти

source: Yes
ru_ru: Да

source: No
ru_ru: Нет

source: Unable to open history data file: %s
ru_ru: Невозможно открыть файл-историю: %s

source: Unable to execute commands on non-local filesystems
ru_ru: Невозможно выполнять команды на нелокальных файловых системах

source: Error executing internal command %s: %s
ru_ru: Ошибка выполнения внутренней команды %s: %s

source: Invalid alias type: %s
ru_ru: Неверный тип алиаса: %s

source: Unable to replace an alias %s: %s
ru_ru: Невозможно заменить алиас %s: %s

source: History
ru_ru: История

source: Error executing bind (%s): %s
ru_ru: Ошибка выполнения (%s): %s

source: Really quit %s?
ru_ru: Действительно выйти из %s?

source: %s bytes (%d)
ru_ru: %s байт (%d)

source: Tag group
ru_ru: Отметить группу

source: Untag group
ru_ru: Снять отметку

source: Type FS Rule
ru_ru: Введите FS Rule

source: Action error: %s
ru_ru: Ошибка: %s

source: Unable to chdir to %s: %s
ru_ru: Невозможно перейти в %s: %s

source: TAGGED
ru_ru: ОТМЕТКА

source: Only one of the arguments must be provided
ru_ru: Необходимо предоставить только один из аргументов

source: Invalid class: %s. VFSObject derived expected.
ru_ru: Неверный класс: %s. Требуется дочерний от VFSObject

source: Invalid path: %s.
ru_ru: Неверный путь: %s.

source: Unable to find VFS handler for %s.
ru_ru: Невозможно найти обработчик для %s.

source: Unable to walk on %s
ru_ru: Невозможно перейти в %s

source: Unable to create directory inside %s object type
ru_ru: Невозможно создать каталог внутри объекта типа %s

source: Name
ru_ru: Имя

source: Type
ru_ru: Тип

source: Access time
ru_ru: Дата доступа

source: Modification time
ru_ru: Дата изменения данных (mtime)

source: Change time
ru_ru: Дата изменения inode (ctime)

source: Size in bytes
ru_ru: Размер в байтах

source: Owner
ru_ru: Владелец

source: Group
ru_ru: Группа

source: Access mode
ru_ru: Режим доступа

source: Type-specific data
ru_ru: Дополнительные данные

source: Error creating VFS object: %s
ru_ru: Ошибка создания VFS объекта: %s

source: Unable to chown %s: %s
ru_ru: Невозможно изменить владельца %s: %s

source: Unable to chmod %s: %s
ru_ru: Невозможно изменить права доступа %s: %s

source: Feature not implemented
ru_ru: Данная функция не реализована

source: Bind
ru_ru: Привязка

source: Context
ru_ru: Контекст

source: Method
ru_ru: Метод

source: Keybindings
ru_ru: Комбинации клавиш

source: Error ininitalizing plugin: %s
ru_ru: Ошибка инициализации плагина: %s

source: Complete
ru_ru: Дополнения

source: Management console
ru_ru: Консоль управления

source: Please press key %s Press ENTER to skip key Press ESCAPE to quit dialog
ru_ru: Пожалуйста нажмите клавишу %s Нажмите ENTER чтобы пропустить текущую клавишу Нажмите ESCAPE чтобы выйти

source: Save learned keys?
ru_ru: Сохранить данные?

source: Unable to save learned data
ru_ru: Невозможно сохранить данные

source: Fires upon showing dialog. Arguments: No
ru_ru: Запускается при показе диалоге. Аргументы: Нет

source: Fires when showing detaild plugin info.Arguments: Plugin object
ru_ru: Запускается при показе детальной информации о плагине. Аргументы: Объект плагина

source: Active plugins list
ru_ru: Список активных плагинов

source: Public data
ru_ru: Данные

source: Public methods
ru_ru: Методы

source: N/A
ru_ru: Н/Д

source: Plugin doc
ru_ru: Документация

source: Plugin events
ru_ru: События

source: Error setting up bash: %s
ru_ru: Ошибка настройки bash: %s

source: Shell wrapper
ru_ru: Обёртка для системной оболчки

source: Execute commands in external shell
ru_ru: Выполнение команд во внешней оболчке

source: Fires before command execution. Arguments: a command to be executed
ru_ru: Запускается перед выполнением команды. Аргументы: команда

source: Press ENTER to continue...
ru_ru: Нажмите ENTER для продолжения...

source: Plugin extends FSRule functionality to match objects based on magic database description
ru_ru: Плагин расширяет функциональность FSRule возможностью отмечать объекты в соответствии с базой magic

source: Save panels locations
ru_ru: Сохранить расположения панелей

source: When starting load previously saved locations
ru_ru: При старте, загружает ранее сохранённые позиции

source: Unable to open where data file: %s
ru_ru: Невозможно открыть файл с данными: %s

source: Bookmarks
ru_ru: Закладки

source: Unable to open bookmarks file: %s
ru_ru: Невозможно открыть файл закладок: %s

source: Error parsing bookmarks file: %s
ru_ru: Ошибка разбора файла закладок: %s

source: Press any key. Escape twice to quit.
ru_ru: Нажмите любую клавишу. Нажмите Escape дважды чтобы выйти.

source: Input test
ru_ru: Тест вводимых значений

source: VFS Object Info
ru_ru: Информация о VFS объекте

source: Source:
ru_ru: Источник:

source: Destination:
ru_ru: Назначение:

source: Save attributes
ru_ru: Сохранить аттрибуты

source: Follow links
ru_ru: Следовать по ссылкам

source: TAB to cycle. ENTER to submit. ESCAPE to cancel
ru_ru: TAB - переключение полей. ENTER - ввод значения. ENTER - отмена

source: Useful VFS routines
ru_ru: Полезные утилиты VFS

source: Dialogs for common VFS operations
ru_ru: Диалоги для различных действий с VFS

source: New directory name
ru_ru: Название нового каталога

source: Create directory
ru_ru: Создать каталог

source: Unable to create directory: %s
ru_ru: Невозможно создать каталог: %s

source: Really remove %d objects?
ru_ru: Действительно удалить %d объектов?

source: Really remove %s (%s)?
ru_ru: Действительно удалить %s (%s)?

source: Remove object
ru_ru: Удалить объект

source: All
ru_ru: Все

source: Abort
ru_ru: Прервать

source: Directory is not empty Remove it recursively?
ru_ru: Каталог не пустой Удалить рексурсивно?

source: Remove %s
ru_ru: Удалить %s

source: Removing object: %s
ru_ru: Удаление объекта: %s

source: Removing
ru_ru: Удаление

source: Unable to remove object: %s
ru_ru: Невозможно удалить объект: %s

source: Error removing object: %s
ru_ru: Ошибка удаления объекта: %s

source: %d objects
ru_ru: %d объектов

source: Move
ru_ru: Переместить

source: Moving object: %s
ru_ru: Перемещение объекта: %s

source: Moving
ru_ru: Перемещение

source: Unable to move object: %s
ru_ru: Невозможно переместить объект: %s

source: Move error
ru_ru: Ошибка перемещения

source: Copy
ru_ru: Копировать

source: Copying object: %s
ru_ru: Копирование объекта: %s

source: Copying
ru_ru: Копирование

source: Unable to copy object: %s
ru_ru: Невозможно скопировать объект: %s

source: Copy error
ru_ru: Ошибка копирования

source: ESCAPE to abort
ru_ru: ESCAPE - прервать

source: Skip
ru_ru: Пропустить

source: Skip all
ru_ru: Пропустить всё

source: Object %s already exists. Really override?
ru_ru: Объект %s уже существует. Перезаписать?

source: Override %s
ru_ru: Перезаписать %s

source: An error occured %s: %s
ru_ru: Произошла ошибка %s: %s
